emacs/lisp/literate-config-system.org
#+TITLE: Literate Config System - Emacs Loader
#+AUTHOR: Shape
#+PROPERTY: PACKAGE literate-config-system

* literate-config-system.el — Org-Mode Config Loader
:PROPERTIES:
:CUSTOM_ID: header
:END:

Complete literate programming version of the Guix-native Emacs configuration loader.

** File Header
:PROPERTIES:
:CUSTOM_ID: file-header
:END:

#+begin_src emacs-lisp :tangle literate-config-system.el
;;; literate-config-system.el --- Guix-native Literate Config Loader -*- lexical-binding: t -*-
;; Author: Shape
;; Version: 5.0.0
;; Package-Requires: ((emacs "29.1") (org "9.6") (leaf "0"))
;;; Code:

(require 'org)
(require 'cl-lib)
#+end_src

** Configuration Group & Customization Variables
:PROPERTIES:
:CUSTOM_ID: configuration
:END:

Define the custom group for literate config settings and user-customizable variables.

#+begin_src emacs-lisp :tangle literate-config-system.el
;; ════════════════════════════════════════════════════════════════════
;; § CONFIGURATION
;; ════════════════════════════════════════════════════════════════════

(defgroup literate-config nil
  "Guix-native literate configuration loader."
  :group 'org
  :prefix "lc-")
#+end_src

*** Directory Configuration

Where to find literate org configuration files:

#+begin_src emacs-lisp :tangle literate-config-system.el
(defcustom lc-org-directory
  (expand-file-name "Literative Configurations/" user-emacs-directory)
  "Root directory for literate config org files."
  :type 'directory
  :group 'literate-config)
#+end_src

*** Framework Selection

Choose between leaf.el wrapper or plain require:

#+begin_src emacs-lisp :tangle literate-config-system.el
(defcustom lc-use-leaf t
  "Use leaf for package configuration wrapping."
  :type 'boolean
  :group 'literate-config)
#+end_src

*** Verbosity Control

Control message output during loading:

#+begin_src emacs-lisp :tangle literate-config-system.el
(defcustom lc-silent t
  "Suppress all messages except success and errors."
  :type 'boolean
  :group 'literate-config)
#+end_src

** State Variables
:PROPERTIES:
:CUSTOM_ID: state
:END:

Internal state tracking for the loader.

#+begin_src emacs-lisp :tangle literate-config-system.el
;; ════════════════════════════════════════════════════════════════════
;; § STATE
;; ════════════════════════════════════════════════════════════════════

(defvar lc--load-errors nil
  "Alist of (file . error-message) for failed loads.")

(defvar lc--loaded-packages nil
  "List of successfully loaded package names.")

(defvar lc--load-order nil
  "Ordered list of files as they were processed.")
#+end_src

** Silent Messaging System
:PROPERTIES:
:CUSTOM_ID: messaging
:END:

Conditionally suppress or show messages during loading.

*** Silent Macro

Wraps code to suppress messages when =lc-silent= is enabled:

#+begin_src emacs-lisp :tangle literate-config-system.el
;; ════════════════════════════════════════════════════════════════════
;; § SILENT MESSAGING
;; ════════════════════════════════════════════════════════════════════

(defmacro lc--silent (&rest body)
  "Execute BODY suppressing all messages unless `lc-silent' is nil."
  `(if lc-silent
       (let ((inhibit-message t)
             (message-log-max nil))
         ,@body)
     (progn ,@body)))
#+end_src

*** Logger Function

Simple two-level logger (ok / error):

#+begin_src emacs-lisp :tangle literate-config-system.el
(defun lc--log (level fmt &rest args)
  "Internal logger. LEVEL is 'ok or 'error only.
All other levels are suppressed when `lc-silent' is t."
  (pcase level
    ('ok    (message "✓ %s" (apply #'format fmt args)))
    ('error (message "✗ ERROR: %s" (apply #'format fmt args)))))
#+end_src

** Guix Load-Path Integration
:PROPERTIES:
:CUSTOM_ID: guix-integration
:END:

Ensure packages installed via Guix are on Emacs load-path.

#+begin_src emacs-lisp :tangle literate-config-system.el
;; ════════════════════════════════════════════════════════════════════
;; § GUIX LOAD-PATH INTEGRATION
;; ════════════════════════════════════════════════════════════════════

(defun lc--ensure-guix-load-path ()
  "Ensure Guix Emacs profile is on load-path.
Guix sets EMACSLOADPATH; this makes sure Emacs sees it."
  (let ((guix-load-path (getenv "EMACSLOADPATH")))
    (when guix-load-path
      (lc--silent
       (dolist (path (split-string guix-load-path ":"))
         (when (and (not (string-empty-p path))
                    (file-directory-p path)
                    (not (member path load-path)))
           (add-to-list 'load-path path)))))))
#+end_src

** Org Property Extraction
:PROPERTIES:
:CUSTOM_ID: property-extraction
:END:

Extract metadata from org headline properties.

#+begin_src emacs-lisp :tangle literate-config-system.el
;; ════════════════════════════════════════════════════════════════════
;; § PROPERTY EXTRACTION
;; ════════════════════════════════════════════════════════════════════

(defun lc--extract-props ()
  "Extract package properties from org entry at point.
Returns a plist or nil if no :PACKAGE: property found."
  (let* ((props (org-entry-properties nil 'standard))
         (package (cdr (assoc "PACKAGE" props))))
    (when package
      (list :package  package
            :after    (cdr (assoc "AFTER"    props))
            :depends  (cdr (assoc "DEPENDS"  props))
            :category (cdr (assoc "CATEGORY" props))
            :built-in (cdr (assoc "BUILT-IN" props))
            :defer    (cdr (assoc "DEFER"    props))))))
#+end_src

** Code Block Extraction
:PROPERTIES:
:CUSTOM_ID: code-extraction
:END:

Extract and collect elisp code blocks from org files.

#+begin_src emacs-lisp :tangle literate-config-system.el
;; ════════════════════════════════════════════════════════════════════
;; § CODE BLOCK EXTRACTION
;; ════════════════════════════════════════════════════════════════════

(defun lc--blocks-in-region (beg end tangle-type)
  "Collect src-block contents in region BEG..END matching TANGLE-TYPE.
TANGLE-TYPE is the symbol 'init or 'config."
  (save-excursion
    (let ((result '()))
      (org-element-map
          (org-element-parse-buffer) 'src-block
        (lambda (src)
          (let* ((src-beg  (org-element-property :begin src))
                 (src-end  (org-element-property :end   src))
                 (headline (save-excursion
                             (goto-char src-beg)
                             (org-get-heading t t t t)))
                 (tangle   (save-excursion
                             (goto-char src-beg)
                             (cdr (assoc "TANGLE"
                                        (org-entry-properties nil 'standard)))))
                 (lang     (org-element-property :language src)))
            (when (and (>= src-beg beg)
                       (<= src-end end)
                       (string= lang "emacs-lisp")
                       (pcase tangle-type
                         ('init   (string= tangle "init"))
                         ('config (or (string= tangle "config")
                                     (null tangle)))))
              (push (org-element-property :value src) result)))))
      (mapconcat #'identity (nreverse result) "\n\n"))))
#+end_src

** Leaf Form Generation
:PROPERTIES:
:CUSTOM_ID: leaf-generation
:END:

Build ~leaf~ macro forms from extracted code and properties.

#+begin_src emacs-lisp :tangle literate-config-system.el
;; ════════════════════════════════════════════════════════════════════
;; § LEAF GENERATION
;; ════════════════════════════════════════════════════════════════════

(defun lc--build-leaf (props init-code config-code)
  "Build a leaf form from PROPS, INIT-CODE, and CONFIG-CODE.
Returns an s-expression ready for eval."
  (let* ((package     (intern (plist-get props :package)))
         (after-raw   (plist-get props :after))
         (defer       (plist-get props :defer))
         (after-syms  (when after-raw
                        (mapcar #'intern (split-string after-raw)))))
    `(leaf ,package
       :require t                              ;; ← replaces :straight, just require
       ,@(when after-syms  `(:after ,after-syms))
       ,@(when defer       '(:defer t))
       ,@(when (and init-code (not (string-empty-p init-code)))
           (condition-case err
               `(:init ,(read (concat "(progn\n" init-code "\n)")))
             (error
              (lc--log 'error "Init parse failed for %s: %s"
                       package (error-message-string err))
              nil)))
       ,@(when (and config-code (not (string-empty-p config-code)))
           (condition-case err
               `(:config ,(read (concat "(progn\n" config-code "\n)")))
             (error
              (lc--log 'error "Config parse failed for %s: %s"
                       package (error-message-string err))
              nil))))))
#+end_src

** Plain Require Fallback
:PROPERTIES:
:CUSTOM_ID: require-fallback
:END:

Load packages without leaf if disabled or unavailable.

#+begin_src emacs-lisp :tangle literate-config-system.el
;; ════════════════════════════════════════════════════════════════════
;; § REQUIRE FALLBACK (no leaf)
;; ════════════════════════════════════════════════════════════════════

(defun lc--load-no-leaf (props init-code config-code)
  "Load package from PROPS without leaf.
Runs INIT-CODE, requires package, then runs CONFIG-CODE."
  (let ((package (intern (plist-get props :package))))
    (lc--silent
     (when (and init-code (not (string-empty-p init-code)))
       (eval (read (concat "(progn\n" init-code "\n)")) t))
     (require package nil 'noerror)
     (when (and config-code (not (string-empty-p config-code)))
       (eval (read (concat "(progn\n" config-code "\n)")) t)))))
#+end_src

** File Loader
:PROPERTIES:
:CUSTOM_ID: file-loader
:END:

Load a single org file and process all package headings.

#+begin_src emacs-lisp :tangle literate-config-system.el
;; ════════════════════════════════════════════════════════════════════
;; § FILE LOADER
;; ════════════════════════════════════════════════════════════════════

(defun lc--load-file (file)
  "Process a single org FILE, loading all package headlines within it."
  (condition-case err
      (with-temp-buffer
        (insert-file-contents file)
        (org-mode)
        (goto-char (point-min))

        (while (re-search-forward "^\\* " nil t)
          (save-excursion
            (let* ((props (lc--extract-props))
                   (package (plist-get props :package)))

              (when (and props package)
                (let* ((h-start (point))
                       (h-end   (save-excursion
                                  (org-end-of-subtree t t)
                                  (point)))
                       (init-code   (lc--blocks-in-region h-start h-end 'init))
                       (config-code (lc--blocks-in-region h-start h-end 'config)))

                  (condition-case pkg-err
                      (progn
                        (if lc-use-leaf
                            (lc--silent
                             (eval (lc--build-leaf props init-code config-code) t))
                          (lc--load-no-leaf props init-code config-code))
                        (push package lc--loaded-packages))
                    (error
                     (let ((msg (format "%s in %s: %s"
                                        package
                                        (file-name-nondirectory file)
                                        (error-message-string pkg-err))))
                       (push (cons package msg) lc--load-errors)
                       (lc--log 'error "%s" msg))))))))))
    (error
     (let ((msg (format "File load failed %s: %s"
                        (file-name-nondirectory file)
                        (error-message-string err))))
       (push (cons file msg) lc--load-errors)
       (lc--log 'error "%s" msg)))))
#+end_src

** Directory Scanner
:PROPERTIES:
:CUSTOM_ID: directory-scanner
:END:

Recursively find all .org files in a directory.

#+begin_src emacs-lisp :tangle literate-config-system.el
;; ════════════════════════════════════════════════════════════════════
;; § DIRECTORY SCANNER
;; ════════════════════════════════════════════════════════════════════

(defun lc--collect-files (directory)
  "Recursively collect all .org files under DIRECTORY, sorted."
  (when (file-directory-p directory)
    (sort
     (directory-files-recursively directory "\\.org$")
     #'string<)))
#+end_src

** Main Entry Point - Load Function
:PROPERTIES:
:CUSTOM_ID: main-load
:END:

Public API: Load all literate configurations from directory.

#+begin_src emacs-lisp :tangle literate-config-system.el
;; ════════════════════════════════════════════════════════════════════
;; § MAIN ENTRY POINT
;; ════════════════════════════════════════════════════════════════════

;;;###autoload
(defun literate-config-load ()
  "Load all literate org config files from `lc-org-directory'.
Prints one success line or error details — nothing in between."
  (interactive)
  (setq lc--load-errors    nil
        lc--loaded-packages nil
        lc--load-order      nil)

  (lc--ensure-guix-load-path)

  (let ((files (lc--collect-files lc-org-directory)))
    (if (null files)
        (lc--log 'error "No .org files found in %s" lc-org-directory)
      (dolist (file files)
        (push file lc--load-order)
        (lc--load-file file))

      (if lc--load-errors
          (progn
            (lc--log 'error "%d package(s) failed — see *Messages* for details"
                     (length lc--load-errors))
            (dolist (e lc--load-errors)
              (message "  ✗ %s" (cdr e))))
        (lc--log 'ok "%d packages loaded from %d files"
                 (length lc--loaded-packages)
                 (length files))))))
#+end_src

** Status Report Function
:PROPERTIES:
:CUSTOM_ID: status-function
:END:

Public API: Show detailed status of loaded packages and errors.

#+begin_src emacs-lisp :tangle literate-config-system.el
;;;###autoload
(defun literate-config-status ()
  "Show a summary buffer of loaded packages and any errors."
  (interactive)
  (with-current-buffer (get-buffer-create "*literate-config-status*")
    (erase-buffer)
    (insert (format "Literate Config Status — %s\n\n"
                    (format-time-string "%Y-%m-%d %H:%M:%S")))
    (insert (format "✓ Loaded: %d packages\n" (length lc--loaded-packages)))
    (insert (format "✗ Errors: %d\n\n"        (length lc--load-errors)))
    (when lc--loaded-packages
      (insert "Loaded:\n")
      (dolist (p (reverse lc--loaded-packages))
        (insert (format "  • %s\n" p))))
    (when lc--load-errors
      (insert "\nErrors:\n")
      (dolist (e lc--load-errors)
        (insert (format "  ✗ %s\n" (cdr e)))))
    (display-buffer (current-buffer))))
#+end_src

** Module Footer
:PROPERTIES:
:CUSTOM_ID: footer
:END:

Provide the module and mark it as loaded.

#+begin_src emacs-lisp :tangle literate-config-system.el
(provide 'literate-config-system)
;;; literate-config-system.el ends here
#+end_src

** Architecture Documentation
:PROPERTIES:
:CUSTOM_ID: architecture
:END:

*** How It Works

1. **Bootstrap** - ~init.el~ calls ~literate-config-load~
2. **Discovery** - Scans ~/.config/emacs/Literative Configurations/ for .org files
3. **Parsing** - For each file, finds level-1 headings with ~:PACKAGE:~ property
4. **Extraction** - Collects code blocks tagged ~:tangle: init~ and ~:tangle: config~
5. **Building** - Creates leaf forms with package name, init, config code
6. **Evaluation** - Evaluates leaf forms (or plain require if no leaf)
7. **Reporting** - Prints success count or detailed error messages

*** Key Design Decisions

- **No external package managers** - Uses Guix packages only
- **Guix-aware** - Adds Guix paths to Emacs load-path
- **Silent by default** - Only shows summary, not verbose spam
- **Graceful fallback** - Works without leaf.el if needed
- **Error resilient** - One package error doesn't crash the whole system
- **Simple** - ~288 lines of straightforward elisp

*** The Literate Format

Each org file should have level-1 headings with properties:

#+begin_example
* PACKAGE-NAME
:PROPERTIES:
:PACKAGE: package-name
:CATEGORY: category
:VERSION: 1.0.0
:END:

** Initialization
:PROPERTIES:
:tangle: init
:END:

#+begin_src emacs-lisp
(require 'package-name)
#+end_src

** Configuration  
:PROPERTIES:
:tangle: config
:END:

#+begin_src emacs-lisp
(setq option 'value)
#+end_src
#+end_example

The system:
1. Finds the ~:PACKAGE:~ property
2. Extracts init and config blocks
3. Builds: ~(leaf package-name :require t :init (...) :config (...))~
4. Evaluates the form

*** Usage

From =~/.config/emacs/init.el=:

#+begin_src emacs-lisp
(require 'leaf)
(require 'literate-config-system)
(literate-config-load)
#+end_src

Then check status:

#+begin_src emacs-lisp
(literate-config-status)  ; Shows summary buffer
#+end_src

** Integration with System
:PROPERTIES:
:CUSTOM_ID: system-integration
:END:

This loader is part of LiterativeOS:

- **Guix** - Provides all packages (leaf, org, geiser, opencode, etc.)
- **Org-mode** - Configuration source files
- **Leaf.el** - Declarative configuration framework
- **OpenCode** - AI assistance for development
- **Geiser** - Interactive Scheme/Guile development

All integrated into a cohesive literate programming system.
